{
    "version": "https://jsonfeed.org/version/1",
    "title": "I&#x27;m Win!",
    "description": "",
    "home_page_url": "https://imwin.org",
    "feed_url": "https://imwin.org/feed.json",
    "user_comment": "",
    "author": {
        "name": "Winrich"
    },
    "items": [
        {
            "id": "https://imwin.org/linux-windows-shuang-xi-tong-shi-jian-bu-yi-zhi/",
            "url": "https://imwin.org/linux-windows-shuang-xi-tong-shi-jian-bu-yi-zhi/",
            "title": "Linux Windows 双系统时间不一致",
            "summary": "大家在装完 Linux 系统后，可能会出现 Linux Windows 两个系统的时间不一致，一般是相差 8 小时。下面就来分析该问题，并给出解决办法。 GMT：Greenwich Mean Time，即格林尼治标准时间，也就是世界时。GMT 以地球自转为基础的时间计量系统，但由于地球自转不均匀，导致 GMT 不精确，现在已经不再作为世界标准时间使用。 UTC：Universal Time Coordinated，即协调世界时。UTC 是以原子时秒长为基础，在时刻上尽量接近于 GMT 的一种时间计量系统。为确保 UTC 与 GMT 相差不会超过 0.9 秒，在有需要的情况下会在 UTC 内加上正或负闰秒。UTC 现在作为世界标准时间使用。 RTC：Real-Time Clock，即实时时钟，在计算机领域作为硬件时钟的简称。 世界上不同地区所在的时区是不同的，这些时区决定了当地的本地时间。比如北京处于东八区，即北京时间为 UTC + 8，如果 UTC 时间现在是上午 6 点整，那么北京时间为 14 点整。 Windows 与 Linux 看待硬件时间的方式不同。Windows&hellip;",
            "content_html": "<p>大家在装完 Linux 系统后，可能会出现 Linux Windows 两个系统的时间不一致，一般是相差 8 小时。下面就来分析该问题，并给出解决办法。</p>\n<h2 id=\"原因分析\">原因分析</h2>\n<p>GMT：Greenwich Mean Time，即格林尼治标准时间，也就是世界时。GMT 以地球自转为基础的时间计量系统，但由于地球自转不均匀，导致 GMT 不精确，现在已经不再作为世界标准时间使用。</p>\n<p>UTC：Universal Time Coordinated，即协调世界时。UTC 是以原子时秒长为基础，在时刻上尽量接近于 GMT 的一种时间计量系统。为确保 UTC 与 GMT 相差不会超过 0.9 秒，在有需要的情况下会在 UTC 内加上正或负闰秒。UTC 现在作为世界标准时间使用。</p>\n<p>RTC：Real-Time Clock，即实时时钟，在计算机领域作为硬件时钟的简称。</p>\n<p>世界上不同地区所在的时区是不同的，这些时区决定了当地的本地时间。比如北京处于东八区，即北京时间为 UTC + 8，如果 UTC 时间现在是上午 6 点整，那么北京时间为 14 点整。</p>\n<p>Windows 与 Linux 看待硬件时间的方式不同。Windows 把电脑的硬件时钟（RTC）看成是本地时间，即 RTC = Local Time，Windows 会直接显示硬件时间；而 Linux 则是把电脑的硬件时钟看成 UTC 时间，即 RTC = UTC，那么 Linux 显示的时间就是硬件时间加上时区。</p>\n<h2 id=\"解决办法\">解决办法</h2>\n<p>既然知道了问题原因，我们就知道如何去解决，大概思路分为两种，一是让 Windows 认为硬件时钟是 UTC 时间，二是让 Linux 认为硬件时钟是本地时间。</p>\n<h3 id=\"修改-windows-硬件时钟为-utc-时间\">修改 Windows 硬件时钟为 UTC 时间</h3>\n<p>以管理员身份打开 「PowerShell」，输入以下命令：</p>\n<pre><code>Reg add HKLM\\SYSTEM\\CurrentControlSet\\Control\\TimeZoneInformation /v RealTimeIsUniversal /t REG_DWORD /d 1\n</code></pre>\n<p>或者打开「注册表编辑器」，定位到  <code>计算机\\HKEY_LOCAL_MACHINE\\SYSTEM\\CurrentControlSet\\Control\\TimeZoneInformation</code>  目录下，新建一个  <code>DWORD</code>  类型，名称为  <code>RealTimeIsUniversal</code>  的键，并修改键值为  <code>1</code>  即可。</p>\n<h3 id=\"修改-linux-硬件时钟为本地时间\">修改 Linux 硬件时钟为本地时间</h3>\n<p>这里大家可以根据自己 Linux 发行版的方法来修改。我这里给出现在大多数发行版由  <code>timedatectl</code>  来管理时间的修改方法。</p>\n<p>在终端中，输入以下命令：</p>\n<pre><code>timedatectl set-local-rtc 1 --adjust-system-clock\n</code></pre>\n<p>现在，系统时间显示正常了。</p>\n<p>这两种方法中，本人推荐第一种方法，修改 Windows 的时间管理。因为在 Linux 系统中修改后，输入  <code>timedatectl</code>  命令后，会出现警告，提示你使用 RTC 时钟会导致一些程序错误；并且 Windows 也在更改时间管理方式为 UTC 时间。</p>\n",
            "author": {
                "name": "Winrich"
            },
            "tags": [
                   "收藏夹"
            ],
            "date_published": "2023-08-31T19:01:58+08:00",
            "date_modified": "2023-08-31T19:01:58+08:00"
        },
        {
            "id": "https://imwin.org/about-me/",
            "url": "https://imwin.org/about-me/",
            "title": "About Me",
            "summary": "Hello, everyone! I am Winrich and welcome to my blog. I was born in a small city in central China, and I have faced various challenges and difficulties in my family. When I was around six years old, my parents lost their jobs, and then&hellip;",
            "content_html": "<p>Hello, everyone! I am Winrich and welcome to my blog.</p>\n<h2 id=\"my-story\">My Story</h2>\n<p>I was born in a small city in central China, and I have faced various challenges and difficulties in my family. When I was around six years old, my parents lost their jobs, and then my father suffered a stroke, resulting in partial paralysis. Growing up in such an environment, I felt a sense of unease and confusion about life.</p>\n<p>My childhood memories have become quite blurry, but I still vividly remember a moment in the fourth grade when I was punished by the teacher for being late and mocked by my classmates. It was during that time that I learned to hide my anxiety and put on a carefree facade. However, the teacher’s words - “Shake your leg in front of your disabled father” - left me disheartened and made me lose my gratitude towards the world.</p>\n<p>During my adolescence, I went through a period of waywardness, skipping classes, and even attempting dangerous activities. After experiencing a series of setbacks, I developed an interest in computers and started learning web design and programming languages.</p>\n<h2 id=\"investment-and-trading\">Investment and Trading</h2>\n<p>In 2007, I began to explore the world of futures trading, and through trial and error, I gradually understood the complexities of investment and trading. However, the initial experiences were full of failures and losses, leading me to realize that investing is not a mere game but an art that requires serious study and careful planning.</p>\n<p>After a series of ups and downs, I grew into an investor and developed my own “Cycle Trading Rules.” During a period of introspection and contemplation, my understanding of trading and my mentality underwent a qualitative transformation.</p>\n<h2 id=\"about-this-blog\">About This Blog</h2>\n<p>This blog serves as a record of my investment and trading journey and also as a platform to share my experiences and insights with readers. Through sharing my stories and insights, I hope to motivate more people to embark on the path of investment and become better traders.</p>\n<p>The domain name of this blog is “imwin.org,” which symbolizes “I’m a winner,” and serves as a proud declaration of my trading journey. Through this blog, I hope to connect with readers, engage in discussions about the world of investment, and grow and progress together.</p>\n<h2 id=\"about-winrich\">About “Winrich”</h2>\n<p>“Winrich” is the English name I have chosen for myself. “Win” represents victory and success, while “rich” symbolizes wealth and abundance. For me, this name is not only a personal aspiration but also a constant reminder to maintain a positive mindset and focused spirit in my trading endeavors.</p>\n<h2 id=\"contact-me\">Contact Me</h2>\n<p>If you are interested in my stories and trading experiences or have any questions and suggestions, feel free to reach out to me. You can contact me via email at <a href=\"mailto:blog@imwin.org\">blog@imwin.org</a>  or find me on social media. Looking forward to connecting with you!</p>\n<p>Thank you for visiting my blog, and I hope you find valuable information and inspiration here!</p>\n",
            "author": {
                "name": "Winrich"
            },
            "tags": [
            ],
            "date_published": "2023-08-29T08:17:53+08:00",
            "date_modified": "2023-08-29T08:17:53+08:00"
        }
    ]
}
